Revit 2027 API
Truss.Members Property
Get all the members of truss.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ICollection<ElementId> Members { get; }
Public ReadOnly Property Members As ICollection(Of ElementId)
	Get
public:
property ICollection<ElementId^>^ Members {
	ICollection<ElementId^>^ get ();
}
member Members : ICollection<ElementId> with get
Return Value
ICollection<ElementId>
The Members property returns an ElementIdSet that contains all the member Ids of truss.
See Also
Reference
Truss Class
Autodesk.Revit.DB.Structure Namespace